Revit 2027 API
PrintSetting.Name Property
Returns the Name of Print Setup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
public:
virtual property String^ Name {
	String^ get () override;
	void set (String^ value) override;
}
abstract Name : string with get, set
override Name : string with get, set
Property Value
String
Remarks
Retrieve/set the name of Print Setup.
See Also
Reference
PrintSetting Class
Autodesk.Revit.DB Namespace